<b> 1. Importing libraries <b>

In [1]:
import pandas as pd

<b>2. Importing data <b>

In [2]:
#Importing provided dataset
customers=pd.read_csv(r"C:\Users\Blagoj\Documents\Openclassrooms\Project 5\Analyze your company's sales\customers.csv")
products=pd.read_csv(r"C:\Users\Blagoj\Documents\Openclassrooms\Project 5\Analyze your company's sales\products.csv")
transactions=pd.read_csv(r"C:\Users\Blagoj\Documents\Openclassrooms\Project 5\Analyze your company's sales\transactions.csv")

<b>3. Familiarization with the data <b>

In [3]:
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [4]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [5]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [6]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

In [7]:
transactions.head()

  id_prod                        date session_id client_id
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270
3  0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597
4  0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242

In [8]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337016 entries, 0 to 337015
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     337016 non-null  object
 1   date        337016 non-null  object
 2   session_id  337016 non-null  object
 3   client_id   337016 non-null  object
dtypes: object(4)
memory usage: 10.3+ MB

<b>4. Cleaning the data <b>

<b>4.1 Customers data <b>

In [9]:
#Checking unique sex values
print(sorted(customers['sex'].unique()))

['f', 'm']

In [10]:
#Searching for date of birth outliers. Can see min, max, avg etc.
customers.describe()

             birth
count  8623.000000
mean   1978.280877
std      16.919535
min    1929.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000

In [11]:
#Checking for unusual IDs
customers[['letters','id']]=customers['client_id'].str.split("_", expand=True)
customers.sort_values(by='id')

     client_id sex  birth letters   id
2735      ct_0   f   2001      ct    0
8494      ct_1   m   2001      ct    1
4299       c_1   m   1955       c    1
6894      c_10   m   1956       c   10
2137     c_100   m   1992       c  100
...        ...  ..    ...     ...  ...
7004     c_995   m   1955       c  995
2788     c_996   f   1970       c  996
94       c_997   f   1994       c  997
2145     c_998   m   2001       c  998
7358     c_999   m   1964       c  999

[8623 rows x 5 columns]

In [12]:
#CT stands for customer test so I am removing lines that contain that string.
searchfor=['ct']
customers=customers[~customers.client_id.str.contains('|'.join(searchfor))]
customers.sort_values(by='id')

     client_id sex  birth letters    id
4299       c_1   m   1955       c     1
6894      c_10   m   1956       c    10
2137     c_100   m   1992       c   100
8472    c_1000   f   1966       c  1000
3426    c_1001   m   1982       c  1001
...        ...  ..    ...     ...   ...
7004     c_995   m   1955       c   995
2788     c_996   f   1970       c   996
94       c_997   f   1994       c   997
2145     c_998   m   2001       c   998
7358     c_999   m   1964       c   999

[8621 rows x 5 columns]

In [13]:
#Checking unique IDs
customers["id"].nunique()
#The printed number should correspond to the one returned by customer.info() (8623) - the removed lines (2)

8621

<b> 4.2 Products data <b>

In [14]:
#Checking min and max price values.
products.sort_values(by='price')

     id_prod   price  categ
731      T_0   -1.00      0
2355   0_202    0.62      0
2272   0_528    0.62      0
370    0_120    0.66      0
1211  0_1844    0.77      0
...      ...     ...    ...
2779    2_30  233.54      2
1436   2_167  236.99      2
394    2_158  247.22      2
724     2_76  254.44      2
947      2_2  300.00      2

[3287 rows x 3 columns]

In [15]:
#Removing lines with negative price
products=products[products['price']>=0]
#Having a look at the updated dataframe
products.sort_values(by='price')

     id_prod   price  categ
2272   0_528    0.62      0
2355   0_202    0.62      0
370    0_120    0.66      0
1211  0_1844    0.77      0
1530  0_1620    0.80      0
...      ...     ...    ...
2779    2_30  233.54      2
1436   2_167  236.99      2
394    2_158  247.22      2
724     2_76  254.44      2
947      2_2  300.00      2

[3286 rows x 3 columns]

In [16]:
#Checking unique IDs
products['id_prod'].nunique()
#The printed number should correspond to the one returned by products.info() (3287) - the removed lines (1)

3286

<b> 4.3 Transactions data <b>

In [17]:
transactions.count()

id_prod       337016
date          337016
session_id    337016
client_id     337016
dtype: int64

In [18]:
#Matching transactions with customers
trancust=transactions.merge(customers, how='right', on='client_id', indicator=True)

In [19]:
searchfor2=['both']
#customers without transactions. We find a few but then again, it's normal that some people havent made a purchase.
nomatch=trancust[~trancust._merge.str.contains('|'.join(searchfor2))]

In [20]:
#Examples of customers without transactions
nomatch.head()

       id_prod date session_id client_id sex  birth letters    id      _merge
29516      NaN  NaN        NaN    c_8253   f   2001       c  8253  right_only
99355      NaN  NaN        NaN    c_3789   f   1997       c  3789  right_only
108189     NaN  NaN        NaN    c_4406   f   1998       c  4406  right_only
109296     NaN  NaN        NaN    c_2706   f   1967       c  2706  right_only
111918     NaN  NaN        NaN    c_3443   m   1959       c  3443  right_only

In [21]:
#Matching transactions with products
tranprod=transactions.merge(products, how='left', on='id_prod', indicator=True)

In [22]:
#Looking for values without a match
searchfor3=['both']
notranprod=tranprod[~tranprod._merge.str.contains('|'.join(searchfor3))]

In [23]:
#Listing the product ID of non matches
print(sorted(notranprod['id_prod'].unique()))

['0_2245', 'T_0']

In [24]:
#Counting lines without a match
notranprod.count()

id_prod       303
date          303
session_id    303
client_id     303
price           0
categ           0
_merge        303
dtype: int64

In [25]:
#Examples of transactions without a valid product ID
notranprod.head(5)

,id_prod,date,session_id,client_id,price,categ,_merge
1431,T_0,test_2021-03-01 02:30:02.237420,s_0,ct_1,NaN,NaN,left_only
2365,T_0,test_2021-03-01 02:30:02.237446,s_0,ct_1,NaN,NaN,left_only
2895,T_0,test_2021-03-01 02:30:02.237414,s_0,ct_1,NaN,NaN,left_only
5955,T_0,test_2021-03-01 02:30:02.237441,s_0,ct_0,NaN,NaN,left_only
6235,0_2245,2021-06-17 03:03:12.668129,s_49705,c_1533,NaN,NaN,left_only

In [26]:
#Listing only transactions with good product id.
searchfor3=['left_only']
goodtranprod=tranprod[~tranprod._merge.str.contains('|'.join(searchfor3))]

In [27]:
#Counting lines with a match
goodtranprod.count()
#Expected result is 336713 which is the difference of all transaction lines (337016) and 
                                            #the lines without an existing product (303)

id_prod       336713
date          336713
session_id    336713
client_id     336713
price         336713
categ         336713
_merge        336713
dtype: int64

In [28]:
#Merging goodtranprod (combined transactions and products) with customers so we have all the info for each line in one place
final=goodtranprod.merge(customers, how='left', on='client_id').drop(columns=['letters', 'id'])

In [29]:
final.head()

,id_prod,date,session_id,client_id,price,categ,_merge,sex,birth
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,4.99,0.0,both,f,1977
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,65.75,2.0,both,f,2000
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,10.71,1.0,both,f,1979
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,4.20,0.0,both,m,1963
4,0_1351,2021-07-17 20:34:25.800563,s_63642,c_1242,8.99,0.0,both,f,1980

<b> 5. Conclusion <br>
    I have identified and removed test lines. <br>
    I have searched for outliers and abberations. <br>
    I have validated the integrity of the data; unique IDs, expected values etc. <br>
    I have tested for logical inconsistencies between the 3 tables and removed non matching lines. <b>

<b>6. Exporting updated data <b>

In [30]:
customers.to_csv(r"C:\Users\Blagoj\Documents\Openclassrooms\Project 5\Analyze your company's sales\updatedcustomers.csv")
products.to_csv(r"C:\Users\Blagoj\Documents\Openclassrooms\Project 5\Analyze your company's sales\updatedproducts.csv")
final.to_csv(r"C:\Users\Blagoj\Documents\Openclassrooms\Project 5\Analyze your company's sales\final.csv")
#The analysis continue in the next script. For more info, consult the README file.